# 함수
'''
: 하나의 특정한 목적의 작업을 수행하기 위해서
독립적으로 구성된 프로그램 코드의 집합

(명령문을 모아서 특정하게 사용!)

* 내장함수
: 파이썬이 제공하는 기능(함수)들
print() input() randint()

* 사용자 정의 함수
: 프로그래머가 원하는 함수를 직접 묶어서
만드는 것!


**함수 :
입력, 출력, 기능

* 함수 정의 : 미리 알려준다. 파이썬
* 함수 호출 : 만들어진 함수를 부른다.(실행)

'''
# 함수 만들기
'''
=> define

def 함수명(입력):
    실행명령문
    1,2,3 ...

    return 출력 (결과값)
'''

# 쥬씨 (7_2_1 참고)

# 함수를 정의해 놓으면 나오는 가장 큰 장점
# : 재사용이 가능!!
# : 코드의 중복을 제거!!
# : 코드 분리화(구조화)가능!! -> 가독성이 높아짐!!


# 예제) 두 개의 정수를 받아서 더하는 함수!!

# 기본적으로 프로그램을 실행할 때
# 제일 먼저 호출되는 함수
# main (***.py 이 파일창 전체적 부분이 메인!)
# 파이썬 -> main 숨겨져있음!

# 예제) 세 개의 정수의 크기를 비교하는 함수!












