'''
실습 1
태어난 년도를 저장
나이를 계산
2021-태어난년도+1

변수명 birth_year : 태어난 년도
        age
출력 (본인 나이 : **)

실습 2
직사각형의 가로길이와 세로길이를
저장하는 변수 면적을 계산하세요

변수명
width , height - 가로, 세로
area - 면적

출력

'''

#ctrl + space = 자동완성!

'''
*자료형(Data type)
: 데이터의 형태, 자료의 형태

부울 (bool) : 참과 거짓을 판별해서 저장하는 자료형
    true/false
    bool (0) 또는 () 를 제외하면 모두 참

정수 (int) : 소숫점 없는 숫자 
실수 (float) : 소숫점 있는 숫자
문자열 (str) : 문자, 단어 등으로 구성된 집합


*고급자료형
리스트, 딕셔너리, 튜플, set(집합) 
'''
#문자열에서 여러줄을 저장하고 싶을 경우에는 "" 사용 금지
# '''~''' 사용

'''
"는 무조건 문자열 앞을 시작한다는 표시
-> 문자열 시작과 끝을 표시 
*문자열 안에서 특정한 행동을 하고 있다는 표시* = \
\' \$ \\ -> 문자! 그냥 문자야! 표시!!
\n -> 줄바꿈
\t -> tab만큼 띄어쓰기

"" '' 문자 저장 가능함!
"" '' 문자열 + \0 (null) 자동적으로 저장 

*문자열 한글자씩 접근 = [] 로 표시
-> index 사용!
-> 컴퓨터는 0부터 숫자 시작
-> 변수명 [index]
예)   YELIM
index 01234 번

*문자열 (리터널 상수) - 변경불가능한 값, 고정값 
상수 : 고정된 값

*문자열 슬라이싱 (자른다)
-> 원하는 부분만 가지고 오기
-> 변수[시작번지:끝번지] =index번호로
- 시작번지 : 자신의 데이터를 포함
(처음부터 시작일경우 0 생략 가능/공백 여부 상관없음)
- 끝번지 : 자신의 데이터를 포함 X
(맨 끝까지 할 경우 공백 가능)
-> 글자를 따로 빼서 변경은 불가능!


*python 따로 저장







