# 클래스
'''
: 객체를 정의해놓은 것

* 클래스 용도
: 객체를 생성하는 데 사용

* 객체?
: 실제로 존재하는 것, 사물 또는 개념 

* 객체의 용도
: 객체의 속성과 기능에 따름


*클래스? c언어 : 구조체 + 함수
         java , c++ : 알겄졔~

: 사용자 정의 자료형 
'''

# 클래스 : 설계도
# ex) 붕어빵 틀, 과자틀

# 객체 : 실제 사물, 물건
# ex)붕어빵, 과자


# 클래스 생성 방법
'''
클래스명() -> 메모리에 할당하고
            객체 생성, 인스턴스 생성 후
            주소값을 반환한다.

        그 주소를 저장하는 것이 class!
'''
# id(데이터) 내장함수
# : 객체의 주소를 반환하는 함수

# 클래스 안에 메서드 매개변수자리는
# 무조건 self 변수 먼저 작성
# 호출 시 호출한 객체 자신이 전달!(주소값)
# def 함수명(self):

# 객체는 기본적으로 인스턴스를 포함
# 인스턴스는 클래스로부터 생성된 것!


# 클래스 안에서 변수 (2)

# 클래스 변수 / 인스턴스 변수

'''
클래스 변수
: 모든 인스턴스가 공유를 함
    인스턴스가 생성되기 이전에
    이미 메모리 공간에 할당되어 있음

인스턴스 변수
: 객체를 생성 하면 해당 인스턴스 변수는
    해당 인스턴스만 사용 가능
  인스턴스가 생성되는 시점에 메모리 공간에
    할당되어있음
'''














